tiborsimon/embedded-tdd-headers/pic/pic18/pic18f8585_tdd.h
#define RXF14SIDH_SID3                522
#define RXF14SID4                     523
#define RXF14SIDH_SID4                524
#define RXF14SID5                     525
#define RXF14SIDH_SID5                526
#define RXF14SID6                     527
#define RXF14SIDH_SID6                528
#define RXF14SID7                     529
#define RXF14SIDH_SID7                530
#define RXF14SID8                     531
#define RXF14SIDH_SID8                532
#define RXF14SID9                     533
#define RXF14SIDH_SID9                534
#define RXF14SIDH_SID10               535
#define RXF14SID10                    536
#define RXF14SIDL                     537
#define RXF14SIDL_EID16               538
#define RXF14EID16                    539
#define RXF14SIDL_EID17               540
#define RXF14EID17                    541
#define RXF14SIDL_EXIDEN              542
#define RXF14EXIDEN                   543
#define RXF14SIDL_EXIDE               544
#define RXF14SID0                     545
#define RXF14SIDL_SID0                546
#define RXF14SID1                     547
#define RXF14SIDL_SID1                548
#define RXF14SID2                     549
#define RXF14SIDL_SID2                550
#define RXF14EIDH                     551
#define RXF14EID8                     552
#define RXF14EIDH_EID8                553
#define RXF14EID9                     554
#define RXF14EIDH_EID9                555
#define RXF14EID10                    556
#define RXF14EIDH_EID10               557
#define RXF14EID11                    558
#define RXF14EIDH_EID11               559
#define RXF14EID12                    560
#define RXF14EIDH_EID12               561
#define RXF14EID13                    562
#define RXF14EIDH_EID13               563
#define RXF14EID14                    564
#define RXF14EIDH_EID14               565
#define RXF14EID15                    566
#define RXF14EIDH_EID15               567
#define RXF14EIDL                     568
#define RXF14EIDL_EID0                569
#define RXF14EID0                     570
#define RXF14EIDL_EID1                571
#define RXF14EID1                     572
#define RXF14EIDL_EID2                573
#define RXF14EID2                     574
#define RXF14EIDL_EID3                575
#define RXF14EID3                     576
#define RXF14EIDL_EID4                577
#define RXF14EID4                     578
#define RXF14EIDL_EID5                579
#define RXF14EID5                     580
#define RXF14EIDL_EID6                581
#define RXF14EID6                     582
#define RXF14EIDL_EID7                583
#define RXF14EID7                     584
#define RXF15SIDH                     585
#define RXF15SID3                     586
#define RXF15SIDH_SID3                587
#define RXF15SID4                     588
#define RXF15SIDH_SID4                589
#define RXF15SID5                     590
#define RXF15SIDH_SID5                591
#define RXF15SID6                     592
#define RXF15SIDH_SID6                593
#define RXF15SID7                     594
#define RXF15SIDH_SID7                595
#define RXF15SID8                     596
#define RXF15SIDH_SID8                597
#define RXF15SID9                     598
#define RXF15SIDH_SID9                599
#define RXF15SID10                    600
#define RXF15SIDH_SID10               601
#define RXF15SIDL                     602
#define RXF15EID16                    603
#define RXF15SIDL_EID16               604
#define RXF15EID17                    605
#define RXF15SIDL_EID17               606
#define RXF15SIDL_EXIDEN              607
#define RXF15SIDL_EXIDE               608
#define RXF15EXIDEN                   609
#define RXF15SID0                     610
#define RXF15SIDL_SID0                611
#define RXF15SIDL_SID1                612
#define RXF15SID1                     613
#define RXF15SIDL_SID2                614
#define RXF15SID2                     615
#define RXF15EIDH                     616
#define RXF15EID8                     617
#define RXF15EIDH_EID8                618
#define RXF15EID9                     619
#define RXF15EIDH_EID9                620
#define RXF15EID10                    621
#define RXF15EIDH_EID10               622
#define RXF15EID11                    623
#define RXF15EIDH_EID11               624
#define RXF15EID12                    625
#define RXF15EIDH_EID12               626
#define RXF15EID13                    627
#define RXF15EIDH_EID13               628
#define RXF15EID14                    629
#define RXF15EIDH_EID14               630
#define RXF15EID15                    631
#define RXF15EIDH_EID15               632
#define RXF15EIDL                     633
#define RXF15EIDL_EID0                634
#define RXF15EID0                     635
#define RXF15EIDL_EID1                636
#define RXF15EID1                     637
#define RXF15EIDL_EID2                638
#define RXF15EID2                     639
#define RXF15EIDL_EID3                640
#define RXF15EID3                     641
#define RXF15EIDL_EID4                642
#define RXF15EID4                     643
#define RXF15EIDL_EID5                644
#define RXF15EID5                     645
#define RXF15EIDL_EID6                646
#define RXF15EID6                     647
#define RXF15EIDL_EID7                648
#define RXF15EID7                     649
#define RXFCON0                       650
#define RXF0EN                        651
#define RXF1EN                        652
#define RXF2EN                        653
#define RXF3EN                        654
#define RXF4EN                        655
#define RXF5EN                        656
#define RXF6EN                        657
#define RXF7EN                        658
#define RXFCON1                       659
#define RXF8EN                        660
#define RXF9EN                        661
#define RXF10EN                       662
#define RXF11EN                       663
#define RXF12EN                       664
#define RXF13EN                       665
#define RXF14EN                       666
#define RXF15EN                       667
#define SDFLC                         668
#define DFLC0                         669
#define DFLC1                         670
#define DFLC2                         671
#define DFLC3                         672
#define DFLC4                         673
#define RXFBCON0                      674
#define F0BP_01                       675
#define F0BP_0                        676
#define F0BP_1                        677
#define F0BP_2                        678
#define F0BP_3                        679
#define F1BP_0                        680
#define F1BP_1                        681
#define F1BP_2                        682
#define F1BP_3                        683
#define RXFBCON1                      684
#define F2BP_0                        685
#define F2BP_01                       686
#define F2BP_1                        687
#define F2BP_2                        688
#define F2BP_3                        689
#define F3BP_0                        690
#define F3BP_1                        691
#define F3BP_2                        692
#define F3BP_3                        693
#define RXFBCON2                      694
#define F4BP_0                        695
#define F4BP_01                       696
#define F4BP_1                        697
#define F4BP_2                        698
#define F4BP_3                        699
#define F5BP_0                        700
#define F5BP_1                        701
#define F5BP_2                        702
#define F5BP_3                        703
#define RXFBCON3                      704
#define F6BP_0                        705
#define F6BP_01                       706
#define F6BP_1                        707
#define F6BP_2                        708
#define F6BP_3                        709
#define F7BP_0                        710
#define F7BP_1                        711
#define F7BP_2                        712
#define F7BP_3                        713
#define RXFBCON4                      714
#define F8BP_0                        715
#define F8BP_01                       716
#define F8BP_1                        717
#define F8BP_2                        718
#define F8BP_3                        719
#define F9BP_0                        720
#define F9BP_1                        721
#define F9BP_2                        722
#define F9BP_3                        723
#define RXFBCON5                      724
#define F10BP_01                      725
#define F10BP_0                       726
#define F10BP_1                       727
#define F10BP_2                       728
#define F10BP_3                       729
#define F11BP_0                       730
#define F11BP_1                       731
#define F11BP_2                       732
#define F11BP_3                       733
#define RXFBCON6                      734
#define F12BP_01                      735
#define F12BP_0                       736
#define F12BP_1                       737
#define F12BP_2                       738
#define F12BP_3                       739
#define F13BP_0                       740
#define F13BP_1                       741
#define F13BP_2                       742
#define F13BP_3                       743
#define RXFBCON7                      744
#define F14BP_0                       745
#define F14BP_01                      746
#define F14BP_1                       747
#define F14BP_2                       748
#define F14BP_3                       749
#define F15BP_0                       750
#define F15BP_1                       751
#define F15BP_2                       752
#define F15BP_3                       753
#define MSEL0                         754
#define FIL0_0                        755
#define FIL0_1                        756
#define FIL1_0                        757
#define FIL1_1                        758
#define FIL2_0                        759
#define FIL2_1                        760
#define FIL3_0                        761
#define FIL3_1                        762
#define MSEL1                         763
#define FIL4_0                        764
#define FIL4_1                        765
#define FIL5_0                        766
#define FIL5_1                        767
#define FIL6_0                        768
#define FIL6_1                        769
#define FIL7_0                        770
#define FIL7_1                        771
#define MSEL2                         772
#define FIL8_0                        773
#define FIL8_1                        774
#define FIL9_0                        775
#define FIL9_1                        776
#define FIL10_0                       777
#define FIL10_1                       778
#define FIL11_0                       779
#define FIL11_1                       780
#define MSEL3                         781
#define FIL12_0                       782
#define FIL12_1                       783
#define FIL13_0                       784
#define FIL13_1                       785
#define FIL14_0                       786
#define FIL14_1                       787
#define FIL15_0                       788
#define FIL15_1                       789
#define BSEL0                         790
#define B0TXEN                        791
#define B1TXEN                        792
#define B2TXEN                        793
#define B3TXEN                        794
#define B4TXEN                        795
#define B5TXEN                        796
#define BIE0                          797
#define BIE0_RXB0IE                   798
#define DRXB0IE                       799
#define BIE0_RXB1IE                   800
#define DRXB1IE                       801
#define B0IE                          802
#define B1IE                          803
#define B2IE                          804
#define B3IE                          805
#define B4IE                          806
#define B5IE                          807
#define TXBIE                         808
#define TX0IE                         809
#define TXBIE_TXB0IE                  810
#define TXBIE_TXB1IE                  811
#define TXBIE_TX1IE                   812
#define TX2IE                         813
#define TXBIE_TXB2IE                  814
#define B0CON                         815
#define B0CON_TXPRI0                  816
#define B0FILHIT0                     817
#define B0CON_FILHIT0_TXPRI0          818
#define B0CON_FILHIT0                 819
#define B0TXPRI0                      820
#define B0FILHIT1                     821
#define B0CON_TXPRI1                  822
#define B0TXPRI1                      823
#define B0CON_FILHIT1                 824
#define B0CON_FILHIT1_TXPRI1          825
#define B0FILHIT2                     826
#define B0CON_RTREN                   827
#define B0CON_FILHIT2_RTREN           828
#define B0CON_FILHIT2                 829
#define B0RTREN                       830
#define B0FILHIT3                     831
#define B0CON_TXREQ                   832
#define B0TXREQ                       833
#define B0CON_FILHIT3                 834
#define B0CON_FILHIT3_TXREQ           835
#define B0FILHIT4                     836
#define B0CON_TXERR                   837
#define B0CON_FILHIT4                 838
#define B0TXERR                       839
#define B0CON_FILHIT4_TXERR           840
#define RXRTRRO_TXLARB                841
#define B0CON_RTRRO                   842
#define B0TXLARB                      843
#define B0RTRRO                       844
#define B0CON_RTRRO_TXLARB            845
#define B0CON_TXLARB                  846
#define B0CON_RXM1_TXABT              847
#define B0CON_TXABT                   848
#define B0TXABT                       849
#define B0RXM1                        850
#define B0CON_RXM1                    851
#define B0CON_RXFUL                   852
#define B0CON_RXFUL_TXBIF             853
#define B0RXFUL                       854
#define B0CON_TXBIF                   855
#define B0TXB3IF                      856
#define B0SIDH                        857
#define B0SIDH_SID3                   858
#define B0SID3                        859
#define B0SIDH_SID4                   860
#define B0SID4                        861
#define B0SIDH_SID5                   862
#define B0SID5                        863
#define B0SIDH_SID6                   864
#define B0SID6                        865
#define B0SIDH_SID7                   866
#define B0SID7                        867
#define B0SIDH_SID8                   868
#define B0SID8                        869
#define B0SIDH_SID9                   870
#define B0SID9                        871
#define B0SIDH_SID10                  872
#define B0SID10                       873
#define B0SIDL                        874
#define B0SIDL_EID16                  875
#define B0EID16                       876
#define B0SIDL_EID17                  877
#define B0EID17                       878
#define B0SIDL_EXID                   879
#define B0SIDL_EXIDE                  880
#define B0EXID                        881
#define B0SIDL_SRR                    882
#define B0SRR                         883
#define B0SID0                        884
#define B0SIDL_SID0                   885
#define B0SID1                        886
#define B0SIDL_SID1                   887
#define B0SID2                        888
#define B0SIDL_SID2                   889
#define B0EIDH                        890
#define B0EID8                        891
#define B0EIDH_EID8                   892
#define B0EID9                        893
#define B0EIDH_EID9                   894
#define B0EID10                       895
#define B0EIDH_EID10                  896
#define B0EID11                       897
#define B0EIDH_EID11                  898
#define B0EID12                       899
#define B0EIDH_EID12                  900
#define B0EID13                       901
#define B0EIDH_EID13                  902
#define B0EID14                       903
#define B0EIDH_EID14                  904
#define B0EID15                       905
#define B0EIDH_EID15                  906
#define B0EIDL                        907
#define B0EID0                        908
#define B0EIDL_EID0                   909
#define B0EID1                        910
#define B0EIDL_EID1                   911
#define B0EID2                        912
#define B0EIDL_EID2                   913
#define B0EID3                        914
#define B0EIDL_EID3                   915
#define B0EID4                        916
#define B0EIDL_EID4                   917
#define B0EID5                        918
#define B0EIDL_EID5                   919
#define B0EID6                        920
#define B0EIDL_EID6                   921
#define B0EID7                        922
#define B0EIDL_EID7                   923
#define B0DLC                         924
#define B0DLC_DLC0                    925
#define B0DLC0                        926
#define B0DLC_DLC1                    927
#define B0DLC1                        928
#define B0DLC_DLC2                    929
#define B0DLC2                        930
#define B0DLC_DLC3                    931
#define B0DLC3                        932
#define B0DLC_RB0                     933
#define B0RB0                         934
#define B0DLC_RESRB0                  935
#define B0DLC_RB1                     936
#define B0RB1                         937
#define B0DLC_RESRB1                  938
#define B0RXRTR                       939
#define B0DLC_RXRTR                   940
#define B0DLC_TXRTR                   941
#define B0D0                          942
#define B0D00                         943
#define B0D01                         944
#define B0D02                         945
#define B0D03                         946
#define B0D04                         947
#define B0D05                         948
#define B0D06                         949
#define B0D07                         950
#define B0D1                          951
#define B0D10                         952
#define B0D11                         953
#define B0D12                         954
#define B0D13                         955
#define B0D14                         956
#define B0D15                         957
#define B0D16                         958
#define B0D17                         959
#define B0D2                          960
#define B0D20                         961
#define B0D21                         962
#define B0D22                         963
#define B0D23                         964
#define B0D24                         965
#define B0D25                         966
#define B0D26                         967
#define B0D27                         968
#define B0D3                          969
#define B0D30                         970
#define B0D31                         971
#define B0D32                         972
#define B0D33                         973
#define B0D34                         974
#define B0D35                         975
#define B0D36                         976
#define B0D37                         977
#define B0D4                          978
#define B0D40                         979
#define B0D41                         980
#define B0D42                         981
#define B0D43                         982
#define B0D44                         983
#define B0D45                         984
#define B0D46                         985
#define B0D47                         986
#define B0D5                          987
#define B0D50                         988
#define B0D51                         989
#define B0D52                         990
#define B0D53                         991
#define B0D54                         992
#define B0D55                         993
#define B0D56                         994
#define B0D57                         995
#define B0D6                          996
#define B0D60                         997
#define B0D61                         998
#define B0D62                         999
#define B0D63                         1000
#define B0D64                         1001
#define B0D65                         1002
#define B0D66                         1003
#define B0D67                         1004
#define B0D7                          1005
#define B0D70                         1006
#define B0D71                         1007
#define B0D72                         1008
#define B0D73                         1009
#define B0D74                         1010
#define B0D75                         1011
#define B0D76                         1012
#define B0D77                         1013
#define CANSTAT_RO9                   1014
#define CANSTAT_RO9_EICODE0           1015
#define CANSTAT_RO9_EICODE1_ICODE0    1016
#define CANSTAT_RO9_EICODE2_ICODE1    1017
#define CANSTAT_RO9_EICODE3_ICODE2    1018
#define CANSTAT_RO9_EICODE4           1019
#define CANSTAT_RO9_OPMODE0           1020
#define CANSTAT_RO9_OPMODE1           1021
#define CANSTAT_RO9_OPMODE2           1022
#define CANCON_RO9                    1023
#define CANCON_RO9_FP0                1024
#define CANCON_RO9_WIN0_FP1           1025
#define CANCON_RO9_WIN1_FP2           1026
#define CANCON_RO9_WIN2_FP3           1027
#define CANCON_RO9_ABAT               1028
#define CANCON_RO9_REQOP0             1029
#define CANCON_RO9_REQOP1             1030
#define CANCON_RO9_REQOP2             1031
#define B1CON                         1032
#define B1CON_FILHIT0                 1033
#define B1CON_TXPRI0                  1034
#define B1CON_FILHIT0_TXPRI0          1035
#define B1FILHIT0                     1036
#define B1TXPRI0                      1037
#define B1CON_FILHIT1                 1038
#define B1CON_FILHIT1_TXPRI1          1039
#define B1CON_TXPRI1                  1040
#define B1FILHIT1                     1041
#define B1TXPRI1                      1042
#define B1CON_FILHIT2                 1043
#define B1RTREN                       1044
#define B1CON_RTREN                   1045
#define B1FILHIT2                     1046
#define B1CON_FILHIT2_RTREN           1047
#define B1CON_FILHIT3                 1048
#define B1TXREQ                       1049
#define B1CON_TXREQ                   1050
#define B1CON_FILHIT3_TXREQ           1051
#define B1FILHIT3                     1052
#define B1CON_FILHIT4                 1053
#define B1CON_FILHIT4_TXERR           1054
#define B1TXERR                       1055
#define B1FILHIT4                     1056
#define B1CON_TXERR                   1057
#define B1CON_TXLARB                  1058
#define B1CON_RTRRO                   1059
#define B1TXLARB                      1060
#define B1RTRRO                       1061
#define B1CON_RTRRO_TXLARB            1062
#define B1CON_TXABT                   1063
#define B1CON_RXM1                    1064
#define B1RXM1                        1065
#define B1CON_RXM1_TXABT              1066
#define B1TXABT                       1067
#define B1RXFUL                       1068
#define B1CON_RXFUL                   1069
#define B1TXB3IF                      1070
#define B1CON_TXBIF                   1071
#define B1CON_RXFUL_TXBIF             1072
#define B1SIDH                        1073
#define B1SIDH_SID3                   1074
#define B1SID3                        1075
#define B1SIDH_SID4                   1076
#define B1SID4                        1077
#define B1SIDH_SID5                   1078
#define B1SID5                        1079
#define B1SIDH_SID6                   1080
#define B1SID6                        1081
#define B1SIDH_SID7                   1082
#define B1SID7                        1083
#define B1SIDH_SID8                   1084
#define B1SID8                        1085
#define B1SIDH_SID9                   1086
#define B1SID9                        1087
#define B1SIDH_SID10                  1088
#define B1SID10                       1089
#define B1SIDL                        1090
