tiborsimon/embedded-tdd-headers/pic/pic18/pic18f8585_tdd.h
#define CE                            3881
#define PORTJ_RJ5                     3882
#define LB                            3883
#define PORTJ_RJ6                     3884
#define PORTJ_RJ7                     3885
#define UB                            3886
#define LATA                          3887
#define LATA0                         3888
#define LA0                           3889
#define LATA1                         3890
#define LA1                           3891
#define LATA2                         3892
#define LA2                           3893
#define LATA3                         3894
#define LA3                           3895
#define LATA4                         3896
#define LA4                           3897
#define LATA5                         3898
#define LA5                           3899
#define LATA6                         3900
#define LA6                           3901
#define LATB                          3902
#define LB0                           3903
#define LATB0                         3904
#define LB1                           3905
#define LATB1                         3906
#define LB2                           3907
#define LATB2                         3908
#define LB3                           3909
#define LATB3                         3910
#define LB4                           3911
#define LATB4                         3912
#define LB5                           3913
#define LATB5                         3914
#define LB6                           3915
#define LATB6                         3916
#define LB7                           3917
#define LATB7                         3918
#define LATC                          3919
#define LATC0                         3920
#define LC0                           3921
#define LATC1                         3922
#define LC1                           3923
#define LATC2                         3924
#define LC2                           3925
#define LATC3                         3926
#define LC3                           3927
#define LATC4                         3928
#define LC4                           3929
#define LATC5                         3930
#define LC5                           3931
#define LATC6                         3932
#define LC6                           3933
#define LATC7                         3934
#define LC7                           3935
#define LATD                          3936
#define LATD0                         3937
#define LD0                           3938
#define LATD1                         3939
#define LD1                           3940
#define LATD2                         3941
#define LD2                           3942
#define LATD3                         3943
#define LD3                           3944
#define LATD4                         3945
#define LD4                           3946
#define LATD5                         3947
#define LD5                           3948
#define LATD6                         3949
#define LD6                           3950
#define LATD7                         3951
#define LD7                           3952
#define LATE                          3953
#define LATE0                         3954
#define LE0                           3955
#define LATE1                         3956
#define LE1                           3957
#define LATE2                         3958
#define LE2                           3959
#define LATE3                         3960
#define LE3                           3961
#define LATE4                         3962
#define LE4                           3963
#define LATE5                         3964
#define LE5                           3965
#define LATE6                         3966
#define LE6                           3967
#define LATE7                         3968
#define LE7                           3969
#define LATF                          3970
#define LATF0                         3971
#define LF0                           3972
#define LATF1                         3973
#define LF1                           3974
#define LF2                           3975
#define LATF2                         3976
#define LF3                           3977
#define LATF3                         3978
#define LF4                           3979
#define LATF4                         3980
#define LF5                           3981
#define LATF5                         3982
#define LF6                           3983
#define LATF6                         3984
#define LF7                           3985
#define LATF7                         3986
#define LATG                          3987
#define LATG0                         3988
#define LG0                           3989
#define LATG1                         3990
#define LG1                           3991
#define LATG2                         3992
#define LG2                           3993
#define LATG3                         3994
#define LG3                           3995
#define LATG4                         3996
#define LG4                           3997
#define LATH                          3998
#define LH0                           3999
#define LATH0                         4000
#define LH1                           4001
#define LATH1                         4002
#define LH2                           4003
#define LATH2                         4004
#define LH3                           4005
#define LATH3                         4006
#define LH4                           4007
#define LATH4                         4008
#define LH5                           4009
#define LATH5                         4010
#define LH6                           4011
#define LATH6                         4012
#define LH7                           4013
#define LATH7                         4014
#define LATJ                          4015
#define LATJ0                         4016
#define LJ0                           4017
#define LATJ1                         4018
#define LJ1                           4019
#define LATJ2                         4020
#define LJ2                           4021
#define LATJ3                         4022
#define LJ3                           4023
#define LATJ4                         4024
#define LJ4                           4025
#define LATJ5                         4026
#define LJ5                           4027
#define LATJ6                         4028
#define LJ6                           4029
#define LATJ7                         4030
#define LJ7                           4031
#define TRISA                         4032
#define TRISA_RA0                     4033
#define TRISA0                        4034
#define TRISA_RA1                     4035
#define TRISA1                        4036
#define TRISA2                        4037
#define TRISA_RA2                     4038
#define TRISA_RA3                     4039
#define TRISA3                        4040
#define TRISA_RA4                     4041
#define TRISA4                        4042
#define TRISA_RA5                     4043
#define TRISA5                        4044
#define TRISA_RA6                     4045
#define TRISA6                        4046
#define TRISB                         4047
#define TRISB_RB0                     4048
#define TRISB0                        4049
#define TRISB_RB1                     4050
#define TRISB1                        4051
#define TRISB_RB2                     4052
#define TRISB2                        4053
#define TRISB_RB3                     4054
#define TRISB3                        4055
#define TRISB_RB4                     4056
#define TRISB4                        4057
#define TRISB_RB5                     4058
#define TRISB5                        4059
#define TRISB_RB6                     4060
#define TRISB6                        4061
#define TRISB_RB7                     4062
#define TRISB7                        4063
#define TRISC                         4064
#define TRISC0                        4065
#define TRISC_RC0                     4066
#define TRISC1                        4067
#define TRISC_RC1                     4068
#define TRISC2                        4069
#define TRISC_RC2                     4070
#define TRISC3                        4071
#define TRISC_RC3                     4072
#define TRISC4                        4073
#define TRISC_RC4                     4074
#define TRISC5                        4075
#define TRISC_RC5                     4076
#define TRISC6                        4077
#define TRISC_RC6                     4078
#define TRISC7                        4079
#define TRISC_RC7                     4080
#define TRISD                         4081
#define TRISD_RD0                     4082
#define TRISD0                        4083
#define TRISD_RD1                     4084
#define TRISD1                        4085
#define TRISD_RD2                     4086
#define TRISD2                        4087
#define TRISD_RD3                     4088
#define TRISD3                        4089
#define TRISD_RD4                     4090
#define TRISD4                        4091
#define TRISD_RD5                     4092
#define TRISD5                        4093
#define TRISD_RD6                     4094
#define TRISD6                        4095
#define TRISD_RD7                     4096
#define TRISD7                        4097
#define TRISE                         4098
#define TRISE_RE0                     4099
#define TRISE0                        4100
#define TRISE1                        4101
#define TRISE_RE1                     4102
#define TRISE2                        4103
#define TRISE_RE2                     4104
#define TRISE_RE3                     4105
#define TRISE3                        4106
#define TRISE_RE4                     4107
#define TRISE4                        4108
#define TRISE_RE5                     4109
#define TRISE5                        4110
#define TRISE_RE6                     4111
#define TRISE6                        4112
#define TRISE_RE7                     4113
#define TRISE7                        4114
#define TRISF                         4115
#define TRISF0                        4116
#define TRISF_RF0                     4117
#define TRISF_RF1                     4118
#define TRISF1                        4119
#define TRISF_RF2                     4120
#define TRISF2                        4121
#define TRISF3                        4122
#define TRISF_RF3                     4123
#define TRISF_RF4                     4124
#define TRISF4                        4125
#define TRISF_RF5                     4126
#define TRISF5                        4127
#define TRISF_RF6                     4128
#define TRISF6                        4129
#define TRISF7                        4130
#define TRISF_RF7                     4131
#define TRISG                         4132
#define TRISG0                        4133
#define TRISG_RG0                     4134
#define TRISG1                        4135
#define TRISG_RG1                     4136
#define TRISG2                        4137
#define TRISG_RG2                     4138
#define TRISG_RG3                     4139
#define TRISG3                        4140
#define TRISG4                        4141
#define TRISG_RG4                     4142
#define TRISH                         4143
#define TRISH_RH0                     4144
#define TRISH0                        4145
#define TRISH_RH1                     4146
#define TRISH1                        4147
#define TRISH_RH2                     4148
#define TRISH2                        4149
#define TRISH_RH3                     4150
#define TRISH3                        4151
#define TRISH_RH4                     4152
#define TRISH4                        4153
#define TRISH_RH5                     4154
#define TRISH5                        4155
#define TRISH_RH6                     4156
#define TRISH6                        4157
#define TRISH_RH7                     4158
#define TRISH7                        4159
#define TRISJ                         4160
#define TRISJ_RJ0                     4161
#define TRISJ0                        4162
#define TRISJ_RJ1                     4163
#define TRISJ1                        4164
#define TRISJ_RJ2                     4165
#define TRISJ2                        4166
#define TRISJ_RJ3                     4167
#define TRISJ3                        4168
#define TRISJ_RJ4                     4169
#define TRISJ4                        4170
#define TRISJ_RJ5                     4171
#define TRISJ5                        4172
#define TRISJ_RJ6                     4173
#define TRISJ6                        4174
#define TRISJ_RJ7                     4175
#define TRISJ7                        4176
#define MEMCON                        4177
#define WM                            4178
#define WM0                           4179
#define WM1                           4180
#define WAIT0                         4181
#define WAIT                          4182
#define WAIT1                         4183
#define EBDIS                         4184
#define PIE1                          4185
#define TMR1IE                        4186
#define TMR2IE                        4187
#define CCP1IE                        4188
#define SSPIE                         4189
#define PIE1_TX1IE                    4190
#define TXIE                          4191
#define RCIE                          4192
#define RC1IE                         4193
#define ADIE                          4194
#define PSPIE                         4195
#define PIR1                          4196
#define TMR1IF                        4197
#define TMR2IF                        4198
#define CCP1IF                        4199
#define SSPIF                         4200
#define TXIF                          4201
#define PIR1_TX1IF                    4202
#define RCIF                          4203
#define RC1IF                         4204
#define ADIF                          4205
#define PSPIF                         4206
#define IPR1                          4207
#define TMR1IP                        4208
#define TMR2IP                        4209
#define CCP1IP                        4210
#define SSPIP                         4211
#define TX1IP                         4212
#define TXIP                          4213
#define RC1IP                         4214
#define RCIP                          4215
#define ADIP                          4216
#define PSPIP                         4217
#define PIE2                          4218
#define CCP2IE                        4219
#define TMR3IE                        4220
#define LVDIE                         4221
#define BCLIE                         4222
#define EEIE                          4223
#define CMIE                          4224
#define PIR2                          4225
#define CCP2IF                        4226
#define TMR3IF                        4227
#define LVDIF                         4228
#define BCLIF                         4229
#define EEIF                          4230
#define CMIF                          4231
#define IPR2                          4232
#define CCP2IP                        4233
#define TMR3IP                        4234
#define LVDIP                         4235
#define BCLIP                         4236
#define EEIP                          4237
#define CMIP                          4238
#define PIE3                          4239
#define FIFOWMIE                      4240
#define PIE3_RXB0IE                   4241
#define RXBnIE                        4242
#define PIE3_RXB1IE                   4243
#define RXBNIE                        4244
#define PIE3_TXB0IE                   4245
#define PIE3_TXB1IE                   4246
#define TXBnIE                        4247
#define PIE3_TXB2IE                   4248
#define TXBNIE                        4249
#define ERRIE                         4250
#define WAKIE                         4251
#define IRXIE                         4252
#define PIR3                          4253
#define FIFOWMIF                      4254
#define RXB0IF                        4255
#define RXBnIF                        4256
#define RXBNIF                        4257
#define RXB1IF                        4258
#define TXB0IF                        4259
#define TXB1IF                        4260
#define TXB2IF                        4261
#define TXBNIF                        4262
#define TXBnIF                        4263
#define ERRIF                         4264
#define WAKIF                         4265
#define IRXIF                         4266
#define IPR3                          4267
#define RXB0IP                        4268
#define FIFOWMIP                      4269
#define RXB1IP                        4270
#define RXBNIP                        4271
#define RXBnIP                        4272
#define TXB0IP                        4273
#define TXB1IP                        4274
#define TXBNIP                        4275
#define TXBnIP                        4276
#define TXB2IP                        4277
#define ERRIP                         4278
#define WAKIP                         4279
#define IRXIP                         4280
#define EECON1                        4281
#define EECON1_RD                     4282
#define EECON1_WR                     4283
#define WREN                          4284
#define WRERR                         4285
#define FREE                          4286
#define CFGS                          4287
#define EEFS                          4288
#define EEPGD                         4289
#define RCSTA                         4290
#define RX9D1                         4291
#define RCD8                          4292
#define RX9D                          4293
#define OERR1                         4294
#define OERR                          4295
#define FERR1                         4296
#define FERR                          4297
#define ADDEN1                        4298
#define ADDEN                         4299
#define ADEN                          4300
#define CREN1                         4301
#define CREN                          4302
#define SREN                          4303
#define SRENA                         4304
#define SREN1                         4305
#define RX91                          4306
#define RX9                           4307
#define RC8_9                         4308
#define RC9                           4309
#define SPEN                          4310
#define SPEN1                         4311
#define TXSTA                         4312
#define TXD8                          4313
#define TX9D1                         4314
#define TX9D                          4315
#define TRMT                          4316
#define TRMT1                         4317
#define BRGH1                         4318
#define BRGH                          4319
#define SENDB1                        4320
#define SENDB                         4321
#define SYNC                          4322
#define SYNC1                         4323
#define TXEN1                         4324
#define TXEN                          4325
#define TX91                          4326
#define TX8_9                         4327
#define TX9                           4328
#define CSRC1                         4329
#define CSRC                          4330
#define PSPCON                        4331
#define PSPMODE                       4332
#define IBOV                          4333
#define OBF                           4334
#define IBF                           4335
#define T3CON                         4336
#define TMR3ON                        4337
#define TMR3CS                        4338
#define nT3SYNC                       4339
#define T3NSYNC                       4340
#define NOT_T3SYNC                    4341
#define T3SYNC                        4342
#define SOSCEN3                       4343
#define T3CCP1                        4344
#define T3CKPS                        4345
#define T3CKPS0                       4346
#define T3CKPS1                       4347
#define T3CCP2                        4348
#define T3CON_RD16                    4349
#define RD163                         4350
#define T3RD16                        4351
#define CMCON                         4352
#define CM                            4353
#define CMEN0                         4354
#define CM0                           4355
#define CMEN1                         4356
#define CM1                           4357
#define CMEN2                         4358
#define CM2                           4359
#define CIS                           4360
#define C1INV                         4361
#define C2INV                         4362
#define C1OUT                         4363
#define C2OUT                         4364
#define CVRCON                        4365
#define CVR                           4366
#define CVR0                          4367
#define CVR1                          4368
#define CVR2                          4369
#define CVR3                          4370
#define CVRSS                         4371
#define CVREF                         4372
#define CVRR                          4373
#define CVROEN                        4374
#define CVROE                         4375
#define CVREN                         4376
#define ECCP1AS                       4377
#define PSSBD                         4378
#define PSSBD0                        4379
#define PSSBD1                        4380
#define PSSAC                         4381
#define PSSAC0                        4382
#define PSSAC1                        4383
#define ECCPAS0                       4384
#define ECCPAS                        4385
#define ECCPAS1                       4386
#define ECCPAS2                       4387
#define ECCPASE                       4388
#define CCP2CON                       4389
#define CCP2M                         4390
#define CCP2M0                        4391
#define CCP2M1                        4392
#define CCP2M2                        4393
#define CCP2M3                        4394
#define DC2B0                         4395
#define DC2B                          4396
#define DC2B1                         4397
#define CCP1CON                       4398
#define CCP1M0                        4399
#define CCP1M                         4400
#define CCP1M1                        4401
#define CCP1M2                        4402
#define CCP1M3                        4403
#define DC1B                          4404
#define DC1B0                         4405
#define DC1B1                         4406
#define P1M                           4407
#define P1M0                          4408
#define P1M1                          4409
#define ADCON2                        4410
#define ADCS0                         4411
#define ADCS                          4412
#define ADCS1                         4413
#define ADCS2                         4414
#define ACQT0                         4415
#define ACQT                          4416
#define ACQT1                         4417
#define ACQT2                         4418
#define ADFM                          4419
#define ADCON1                        4420
#define PCFG0                         4421
#define PCFG                          4422
#define PCFG1                         4423
#define PCFG2                         4424
#define CHSN3                         4425
#define PCFG3                         4426
#define VCFG                          4427
#define VCFG0                         4428
#define VCFG01                        4429
#define VCFG11                        4430
#define VCFG1                         4431
#define ADCON0                        4432
#define ADON                          4433
#define nDONE                         4434
#define GO_nDONE                      4435
#define NOT_DONE                      4436
#define GODONE                        4437
#define GO_DONE                       4438
